Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: One adult mentions that when the temperature was more than 20 degrees C. below zero in January, it was good to be able to switch between outside and inside.
nb: Da det var ned mot minus 20 grader i januar, var det godt å kunne bytte på å være ute og inne, forteller de voksne.

source: The planning, building and testing of technological products are included here.
nb: Hvilke endringer i måten vi arbeider på, er nødvendige, dersom vi skal lykkes?

source: The development of digital skills involves working with complex digital texts with an increasing degree of complexity.
nb: Utvikling i digitale ferdigheter innebærer å arbeide med sammensatte digitale tekster med økende grad av kompleksitet.

source: When Täppan began planning to remodel the units, staff went down to the children’s eye-level.
nb: Da Täppan skulle endre utformingen i avdelingene, gikk personalet ned i barnas høyde.

source: It looks like it should be a matter of course that those who have kindergarten teachers’ training take part in the practical work on a par with the assistants’, remarks Gerd Sylvi Steinnes.
nb: Det ser ut til å være en selvfølge at de som har barnehagelærerutdanning, deltar i det praktiske arbeidet på lik linje med assistentene, forteller Gerd Sylvi Steinnes.

source: Teaching shall be work-related and shall prepare the pupil for a vocation that is constantly changing and which demands a high level of efficiency.
nb: Opplæringen skal være yrkesrelatert og forberede eleven til et arbeidsliv med høy omstillingstakt og krav til effektivitet.

source: listen to, summarise main content and extract relevant information from spoken and visualised texts
nb: lytte til, oppsummere hovedinnhold og trekke ut relevant informasjon i muntlige og visualiserte tekster

source: The pupils demonstrate and develop competence in the subject in year 4 when using well-reasoned strategies and representations in their work with the four arithmetical operations, and explaining their thought processes.
nb: Elevene viser og utvikler kompetanse i faget på 4. trinn når de bruker hensiktsmessige strategier og representasjoner i arbeidet med de fire regneartene og til å forklare tenkemåtene sine.

source: Developing historical overviews and insight, and training skills in everyday life and participation in society are key elements of this main subject area.
nb: Utvikling av historisk overblikk og innsikt og øving av ferdigheter for hverdagsliv og deltakelse i samfunnet er sentrale elementer i hovedområdet.

source: focuses on cultural understanding in a broad sense.
nb: dreier seg om å videreutvikle muntlig og skriftlig kommunikasjon, lese- og skrivekompetanse.

source: The curriculum for mother tongue teaching for language minorities is a level-oriented plan not related to age.
nb: Læreplan i morsmål for språklige minoriteter er en aldersuavhengig og nivåbasert plan.

source: And that is quite unique,” Sakshaug reminds us.
nb: Og det er ganske unikt, minner Sakshaug om.

source: describe the structure of animal and plant cells and explain the main characteristics of photosynthesis and cellular respiration
nb: beskrive oppbygningen av dyre- og planteceller og forklare hovedtrekkene i fotosyntese og celleånding

source: The virus can be killed by soap and water, as well as disinfectant with alcohol and temperatures over 60°C.
nb: Viruset tåler ikke såpe og vann, heller ikke desinfeksjon med alkohol eller temperaturer over 60°C.

source: There are stages in all the sections of Täppan.
nb: Scener finnes på alle avdelingene i Täppan.

source: countries that have been working with assessment for learning
nb: land som har arbeidd med vurdering for læring over tid.

source: It is important not to blame individuals for the outbreak.
nb: Undervisningen gjennomføres i de gjeldende kohorter.

source: for students with special needs who cannot be accommodated in such cases.
nb: for et tilbud på skolen for elever som har et særlig behov som ikke kan ivaretas i slike tilfeller.

source: Digital skills also means being knowledgeable about privacy protection and copyrights, and being able to use and comply with rules and norms that apply to internet-based communication.
nb: Digitale ferdigheter betyr også å være orientert om personvern og opphavsrett, og kunne bruke og følge gjeldende regler og normer for internettbasert kommunikasjon.

source: in Marketing and management involves preparing statistics and diagrams to show results from surveys and studies in the subject.
nb: i markedsføring og ledelse innebærer å utarbeide statistikk og diagrammer for å vise resultater av undersøkelser og studier i faget.

source: This also applies to Täppan.
nb: Det gjelder også for Täppan.

source: The programme subject also covers plants and correct care of plants under different environmental and climatic conditions.
nb: Videre omfatter programfaget planter og riktig skjøtsel av plantemateriale under ulike miljø- og klimaforhold.

source: The pupils shall have the opportunity to experiment without fear of failure.
nb: Elevene skal få mulighet til å prøve seg fram.

source: express him/herself in writing and orally in a varied, differentiated and precise manner, with good progression and coherence
nb: uttrykke seg skriftlig og muntlig på en nyansert og presis måte, med flyt og sammenheng

source: Should he comply with the kindergarten’s rules?
nb: Skal han følge barnehagens regler?

source: carry out work at a fish farm in line with current regulations and ethical guidelines
nb: utføre arbeid i et oppdrettsanlegg i tråd med gjeldende regelverk og yrkesetiske retningslinjer

source: explain how political ideologies cope with power and distribution issues, and elaborate on and discuss notions of justice and distribution
nb: forklare hvordan politiske ideologier behandler makt- og fordelingsspørsmål og drøfte oppfatninger av rettferdighet og fordeling

source: After Level Vg3 general study programmes
nb: Etter Vg3 studieforberedende utdanningsprogram

source: The teaching based on this curriculum is meant to promote adapted education in accordance with current regulations in the Education Act and to safeguard linguistic minorities’ need for special instruction in Norwegian.
nb: Opplæringen etter denne læreplanen skal fremme tilpasset opplæring i henhold til gjeldende bestemmelser i Opplæringsloven og ivareta språklige minoriteters behov for særskilt norskopplæring.

source: Unfortunately, we still have a long way to go before we have full inclusion’, comments Lindqvist.
nb: Men også her er det et langt stykke fram før vi når full inkludering, sier Lindqvist.

source: discuss and elaborate on the ideas and forces that led to the American struggle for freedom and the French revolution, and the consequences these had for the development of democracy in Norway
nb: gjøre rede for ideer og krefter som førte til den amerikanske frihetskampen og den franske revolusjonen, og beskrive følger dette fikk for den demokratiske utviklingen i Norge

source: durability, function and aesthetic expression
nb: holdbarhet, funksjon og estetisk uttrykk

source: analyze, elaborate on and discuss how communication affects interpersonal relationships and social structures
nb: analysere og drøfte hvordan kommunikasjon påvirker mellommenneskelige relasjoner og sosiale strukturer

source: They felt incompetent, that they didn’t tackle a job they actually knew well.”
nb: De følte at de var inkompetente og ikke mestret en jobb de egentlig kjenner godt.

source: It also means being able to understand concepts such as scenario, prognosis and probability.
nb: I tillegg vil det si å forstå begreper som scenarier, prognoser og sannsynlighet.

source: The comforter was good to have, too.
nb: Trøsteren har de også behov for.

source: In the worst case, this type of stress can lead to an increase in sick leave’, comments psychologist Klara Øverland’, who has studied the employees.
nb: I verste fall kan denne typen stress føre til økt sykefravær, mener psykolog Klara Øverland, som har studert de ansatte.

source: Sonny joins Sofie on the blanket and says ‘I sit’.
nb: Sonny setter seg da på teppet sammen med Sofie og sier «Jeg sitter».

source: This is not something the adults decide on their own.
nb: Det er ikke noe de voksne styrer alene.

source: prepare oral or written texts inspired by English-language literature and child culture
nb: lage egne tegnspråklige og/eller talespråklige eller skriftlige tekster inspirert av engelskspråklig litteratur og barnekultur

source: Settlement patterns and global population development are also included in the main subject area.
nb: Bosettingsmønstre og global befolkningsutvikling inngår også i hovedområdet.

source: give grounds for personal choices of literature and reading material based on knowledge of reading strategies
nb: bruke varierte og fleksible strategier i avlesning av skjønnlitteratur og sakprosa

source: in KRLE is helpful to explore religion and philosophies of life to find different presentations and perspectives.
nb: i KRL er en hjelp til å utforske religioner og livssyn for å finne ulike presentasjoner og perspektiver.

source: The pupils also demonstrate and develop competence when using knowledge and skills to formulate and solve problems relating to everyday life and society.
nb: Elevene viser og utvikler også kompetanse når de bruker kunnskap og ferdigheter til å formulere og løse problemer som er knyttet til hverdagen og samfunnet.

source: When children start kindergarten, their parents stay with them for the first three days.
nb: Når barna begynner i barnehagen, skal foreldrene være der de tre første dagene.

source: discuss how language can be perceived as discriminatory and intimidating
nb: uttrykke seg i fortid, nåtid og fremtid med de vanligste verbene og

source: This is to be documented, but not evaluated.
nb: Den skal dokumenteres, men ikke vurderes.

source: explore, name and place decimal numbers on the number line explore strategies for calculating with decimal numbers and compare
nb: utforske, navngi og plassere desimaltall på tallinjen utforske strategier for regning med desimaltall og sammenligne med

source: It is equipped with tables and chairs of different heights, adapted to the different ages.
nb: Her finnes det bord og stoler i ulike høyder, tilpasset de ulike alderstrinnene.

source: read and analyse a wide selection of texts in different genres and media in Bokmål and Nynorsk and present possible interpretations
nb: bruke grunnleggende regler og mønstre for uttale, intonasjon, rettskriving, grammatikk og ulike setningstyper

source: the consequences any violation of these may have for the individual and for society, in both the short and long run
nb: hvilke konsekvenser brudd på disse kan ha for den enkelte og for samfunnet på kort og lang sikt

source: Establish good procedures for collaboration with school health services, the Educational and
nb: Etablerer gode rutiner for samarbeid med skolehelsetjenesten, PPT, barnevern og andre kommunale

source: Competence aims after Year 4
nb: Kompetansemål etter 4. årstrinn

source: It means posing questions, participating in talks and discussions of mathematical situations and problems, and presenting a reasoned argument for one’s own proposed solution.
nb: Det vil si å stille spørsmål, delta i samtaler og drøftinger av matematiske situasjoner og problemer og argumentere for egne løsningsforslag.

source: Both in Norway and abroad, English is used within higher education, in the sciences and in working life.
nb: Både i Norge og i utlandet brukes engelsk innen høyere utdanning, vitenskap og arbeidsliv.

source: use their own experiences to talk about differences and similarities between their mother tongue and Norwegian
nb: bruke egne erfaringer til å snakke om forskjeller og likheter mellom eget morsmål og norsk

source: The main subject area deals with oral, written and non-verbal communicative processes, with an emphasis on interaction between individuals and within and between groups and organizations.
nb: Hovedområdet dreier seg om muntlige, skriftlige og ikke-verbale kommunikasjonsprosesser med vekt på samhandling mellom individer, og i og mellom grupper og organisasjoner.

source: Nearly 12 per cent of the children say that they are often bullied in kindergarten.
nb: Nesten 12 prosent av barna sier at de ofte blir plaget i barnehagen.

source: The main subject area is concerned with how society can utilize rock types, loose masses, water and the atmosphere.
nb: Hovedområdet handler om hvordan samfunnet kan utnytte bergarter, løsmasser, vann og atmosfære.

source: They have also examined which values are passed along, and whether the employees consider some values more important than others.
nb: De har også gransket hvilke verdier som overføres, og om de ansatte ser på noen verdier som viktigere enn andre.

source: ‘The new Framework Plan for Kindergartens has made it easier for the Sámi kindergarten to plan its kindergarten year’, comments Sarabakken.
nb: Den nye rammeplanen har gjort det enklere for den samiske barnehagen å planlegge barnehageåret, mener Sarabakken.

source: give an account of a wide register of linguistic devices and explain their function
nb: dokumentere hvordan norsk tegnspråk har blitt påvirket og endret over tid

source: In the Politics, the individual and society programme subject, basic skills are understood as follows:
nb: I politikk, individ og samfunn forstås grunnleggende ferdigheter slik:

source: discuss and elaborate on consumer rights and discuss consumer ethical responsibilities
nb: gjøre rede for rettighetene en har som forbruker og diskutere forbrukerens etiske ansvar

source: About 54 per cent answered that they are never allowed to help decide what to do on the field trips.
nb: 54 prosent oppga at de aldri fikk være med på å velge hva de skulle gjøre på turene.

source: tell about some local and key Norwegian personalities, places and events
nb: fortelle om noen lokale og sentrale norske personer, steder og begivenheter

source: Care is a notion that is rarely discussed.
nb: Omsorg er altså noe det sjelden snakkes om.

source: in Machines involves articulating and explaining what must be done, or has been done, to customers, colleagues and suppliers.
nb: i programområde for arbeidsmaskiner innebærer å sette ord på og forklare hva som skal gjøres, eller er utført, til kunder, kolleger og leverandører.

source: To explore may also mean testing or trying out and evaluating work methods, products or equipment.
nb: I naturfag er det å stille spørsmål og bruke data for å lage forklaringer grunnleggende for å utforske.

source: Geography also focuses on explaining similarities and differences between town and country, between nations and between regions.
nb: Geografi dreier seg også om beskrivelse og forklaring av likheter og forskjeller mellom land og byer, nasjoner og regioner, urfolk og nasjonalstater.

source: understand spoken and written texts on a variety of topics
nb: forstå muntlige og skriftlige tekster om en rekke ulike emner

source: interpret and make use of graphic presentations of numbers and other data
nb: tolke og bruke grafiske presentasjoner av tall og andre data

source: The ability to read technical drawings and instructions is essential in practical problem solving, as well as for being able to assess shape, functionality and durability.
nb: Å kunne lese tekniske tegninger og anvisninger er sentralt i praktisk problemløsing og for å kunne vurdere form, funksjonalitet og holdbarhet.

source: Formal features of political activity and the role of the mass media as a political player are also integral to the main subject area.
nb: Formelle trekk ved politisk virksomhet og massemedienes rolle som politisk aktør inngår i hovedområdet.

source: It also focuses on series, convergence and proof by induction.
nb: Videre dreier det seg om rekker, konvergens og induksjonsbevis.

source: Most of the children surveyed like circle time, but nearly 15 per cent responded that they never or almost never like circle time.
nb: De fleste barna i undersøkelsen likte samlingsstunden godt, men nesten 15 prosent svarte at de aldri eller nesten aldri likte samlingsstunden.

source: participate in various activities in nature and tell others about what has been observed
nb: delta i ulike aktiviteter ute i naturen og fortelle om det som er observert

source: For example, that the assistants do more of the practical work, so that the kindergarten teachers get more time to spend on pedagogical work.
nb: For eksempel at assistentene tar en større del av det praktiske arbeidet, og at barnehagelærerne får mer tid til det pedagogiske arbeidet.

source: This main subject area also examines contemporary working life and the principles and values it is based on.
nb: Hovedområdet handler også om arbeidslivet i dag og de prinsipper og verdier det bygger på.

source: solve practical buying and selling tasks
nb: Mat kan tilberedes og serveres på skolen etter

source: explain the concept of functions and be able to convert between different representations of functions
nb: gjøre rede for funksjonsbegrepet og kunne oversette mellom ulike representasjoner av funksjoner

source: Mathematics X for the natural sciences
nb: Matematikk X for realfag – programfag

source: The concept of text is understood as something broad and multifarious.
nb: Tekstbegrepet forstås som vidt og mangfoldig.

source: discuss and evaluate the chemical content in media reports and advertisements
nb: diskutere og vurdere kjemifaglig innhold i medieoppslag og reklame

source: talk about Judaism, the Jewish way of viewing life and ethics with an emphasis on their idea of god, their view of humanity, creed, current ethical challenges and selected Jewish texts
nb: samtale om jødedom, jødisk livstolkning og etikk med vekt på gudsbilde, menneskesyn, trosbekjennelsen, utvalgte tekster og aktuelle etiske utfordringer

source: The interaction between cultural norms and societal control on the one hand and individual actions and choices on the other are key elements of this main subject area.
nb: Samspillet mellom kulturelle normer og samfunnsmessig styring på den ene siden og individuelle handlinger og valg på den andre er sentralt i hovedområdet.

source: describe and reflect on the distinctive characteristics of art, architecture and music related to Islam
nb: beskrive og reflektere over særtrekk ved kunst, arkitektur og musikk knyttet til islam

source: calculate and assess probability in statistics and games simulate outcomes in random trials and calculate the probability that
nb: beregne og vurdere sannsynlighet i statistikk og spill simulere utfall i tilfeldige forsøk og beregne sannsynligheten for at noe

source: Working with literary, technical and composite texts in one’s mother tongue is also included in this main subject area.
nb: Arbeid med litterære, faglige og sammensatte tekster på morsmålet inngår også i dette hovedområdet.

source: Mathematics X - programme subject in programmes for Specialization in General Studies (MAT2-01)
nb: Læreplan i matematikk X - programfag i utdanningsprogram for studiespesialisering (MAT2-01)

source: use programming to explore data in tables and datasets
nb: bruke programmering til å utforske data i tabeller og datasett

source: Kindergarten staff are role models.
nb: Personalet i barnehagen er forbilder.

source: A, b and c, they will learn it all when they start school.
nb: – A, B og C lærer de når de kommer på skolen.

source: Combinatorics and probability
nb: Kombinatorikk og sannsynlighet

source: find and analyze recursive and explicit formulae for numerical patterns with or without digital means, and implement and present simple proofs linked to these formulae
nb: finne og analysere rekursive og eksplisitte formler for tallmønstre med og uten digitale hjelpemidler, og gjennomføre og presentere enkle bevis knyttet til disse formlene

source: involve deriving meaning by lip-reading, listening and expressing oneself using varying degrees of speech or Sign Language chosen on the basis of the pupil's circumstances.
nb: i norsk for døve og sterkt tunghørte innebærer å kunne oppfatte hva som skjer eller formidles og kunne samhandle via ulike språk, kommunikative strategier og medier.

source: The main subject area also looks into ethical concepts and argumentation models, and forms the basis for making one's own opinions and choices.
nb: Hovedområdet omhandler også sentrale etiske begreper og argumentasjonsmodeller, og danner grunnlag for egne meninger og valg.

source: He made video observations of two groups, each of them with 14 children aged between one and three years old.
nb: Her gjorde han videoobservasjoner av to grupper på 14 barn i alderen ett til tre år.

source: It also deals with knowledge of materials and the security and maintenance of facilities.
nb: Videre handler det om materialkunnskap og sikring og vedlikehold av anlegg.

source: express and give grounds for their personal views, and show respect for those of others
nb: uttrykke og grunngi egne standpunkter og vise respekt for andres

source: In this context it is important to be able to consciously evaluate and use sources.
nb: Videre innebærer det å kunne bruke digitale verktøy for å mestre nye tekstformer og uttrykk.

source: It focuses on the organisations in working life and how wages are set.
nb: Det dreier seg og om organisasjonene i arbeidslivet og lønnsdanning.

source: Early effort has become increasingly more important in the kindergarten.
nb: Tidlig innsats er blitt viktigere i barnehagen.

source: The competence aims are described for three levels and are largely based on the Common European Framework of Reference for Languages, which describes and defines six different language levels, from beginners’ level (A1) to advanced level (C2), and what skills and knowledge of languages are associated with each level.
nb: Kompetansemålene er beskrevet for tre nivåer og er for en stor del basert på det europeiske rammeverket for språklæring (Common European Framework of Reference for Languages), som beskriver og definerer seks ulike språknivåer fra begynnernivå (A1) til avansert nivå (C2) og hvilke ferdigheter og språkkunnskaper som knyttes til hvert av nivåene.

source: It also involves an increasing use of different tools for calculations, modelling and communication.
nb: Videre innebærer det i økende grad å bruke ulike hjelpemidler i beregninger, modellering og kommunikasjon.

source: choose and use tools, machines, equipment and chemicals for operation and maintenance assignments
nb: velge og bruke verktøy, redskaper, maskiner, utstyr og kjemikalier i tilknytning til drifts- og vedlikeholdsoppgaver

source: commutative, associative and distributive properties to
nb: kommutative, assosiative og distributive egenskaper til å

source: on how people have fought and continue to fight for change in society while also having been and still being influenced by geographic conditions and historical contexts
nb: over hvordan mennesker har kjempet og kjemper for forandringer i samfunnet og samtidig har vært og er påvirket av geografiske forhold og historisk kontekst

source: into the subjects taught, there are three forms of competence
nb: Dette gjelder i overkant av halvparten av lærerne i

source: International perspectives in the subject can help develop cultural understanding, tolerance and respect for others.
nb: Tegnspråkfaget skal legge til rette for utvikling av den enkelte elevs språk- og tekstkompetanse ut fra elevens evner og forutsetninger.

source: If someone would like to go down to the movement room, they can put the doll in that space.
nb: Om noen ønsker å gå ned i bevegelsesrommet, kan de sette dukken i dette rommet.
